--- a/README.md
+++ b/README.md
@@ -40,94 +51,75 @@ Terraform Module CI (Continuous Integration) ensures the quality, consistency, a
 ## CI/CD Workflow
 
 ```mermaid
-flowchart LR
-    A[🔗 SCM - e.g., Git] --> B[🛠 Jenkins Server]
-    B --> C{🚀 Pipeline Job}
-    C --> D[📜 Jenkinsfile]
-    D --> E[📦 Library: your-shared-library-name]
-    E --> F[📂 Shared Library]
-    F --> G{📁 src Directory}
-    G --> H{📁 ci Directory}
-    H --> I{📁 terraform Directory}
-    I --> J{📁 common} & K{📁 template} & L{📁 terraformCI}
-    J --> M[📜 gitclone.groovy] & N[📜 wsclean.groovy]
-    K --> O[📜 template.groovy]
-    L --> P[🔒 checkov.groovy] & Q[💰 cost.groovy] & R[📝 fmt.groovy] & S[⚙️ init.groovy] & T[🔍 lint.groovy] & U[✅ validate.groovy]
+digraph {
+    A[🔗 SCM - e.g., Git] -> B[🛠 Jenkins Server]
+    B -> C{🚀 Pipeline Job}
+    C -> D[📜 Jenkinsfile]
+    D -> E[📦 Shared Library]
+    E -> F{📁 src Directory}
+    F -> G{📁 ci Directory}
+    G -> H{📁 terraform Directory}
+    H -> J{📁 common}
+    H -> K{📁 template}
+    H -> L{📁 terraformCI}
+    J -> M[📜 gitclone.groovy]
+    J -> N[📜 wsclean.groovy]
+    K -> O[📜 template.groovy]
+    L -> P[🔒 checkov.groovy]
+    L -> Q[💰 cost.groovy]
+    L -> R[📝 fmt.groovy]
+    L -> S[⚙️ init.groovy]
+    L -> T[🔍 lint.groovy]
+    L -> U[✅ validate.groovy]
+}
 ```
 
-### Workflow Explanation
+## Workflow Explanation
